#### Import relevant libraries

In [1]:
import numpy as np
import pandas as pd

#### Load dataset

In [2]:
marketing_data = pd.read_csv("data/marketing_campaign.csv")

#### Subset for relevant columns

In [3]:
marketing_data = marketing_data[['Education', 'Marital_Status',
                'Kidhome', 'Teenhome']]

#### Inspect first 5 rows and data types of the dataset

In [4]:
marketing_data.head()

    Education Marital_Status  Kidhome  Teenhome
0  Graduation         Single        0         0
1  Graduation         Single        1         1
2  Graduation       Together        0         0
3  Graduation       Together        1         0
4         PhD        Married        1         0

In [5]:
marketing_data.shape

(2240, 4)

#### Remove duplicates across the four columns

In [6]:
marketing_data_duplicate = marketing_data.drop_duplicates()

In [7]:
marketing_data_duplicate

       Education Marital_Status  Kidhome  Teenhome
0     Graduation         Single        0         0
1     Graduation         Single        1         1
2     Graduation       Together        0         0
3     Graduation       Together        1         0
4            PhD        Married        1         0
...          ...            ...      ...       ...
2134      Master         Absurd        0         0
2147      Master       Together        1         2
2177         PhD           YOLO        0         1
2208       Basic       Together        0         1
2223      Master        Married        1         2

[135 rows x 4 columns]

In [8]:
marketing_data_duplicate.shape

(135, 4)